[DIALOG_100]
BUTTON_1=OK
DIALOG_TITLE=About Rockchip Batch Tool
LABEL_1033=Rockchip Batch Tool
LABEL_1034=Copyright By FuZhou Rockchip
LABEL_1035=
[DIALOG_102]
BUTTON_1000=Firmware Information
BUTTON_1003=...
BUTTON_1015=Connected Devices
BUTTON_1016=Language
BUTTON_1017=Upgrade
BUTTON_1018=Restore
BUTTON_1019=Switch
BUTTON_1020=Clear
BUTTON_1021=Save
BUTTON_1022=Exit
DIALOG_TITLE=Rockchip Batch Tool
LABEL_1001=FW Path:
LABEL_1004=FW Ver:
LABEL_1005=BOOT Ver:
LABEL_1008=FW Time:
LABEL_1009=BOOT Time:
LABEL_1012=Support Chip:
LABEL_1024=1
LABEL_1025=2
LABEL_1026=3
LABEL_1027=4
LABEL_1028=5
LABEL_1029=6
LABEL_1030=7
LABEL_1031=8
LABEL_1032=
LABEL_1033=
LABEL_1034=
LABEL_1035=
LABEL_1036=
LABEL_1037=
LABEL_1038=
LABEL_1039=

[PROMPT]
IDS_LOADINGFW=Loading firmware...
IDS_LOADFWFAIL=Load Firmware Failed!
IDS_LOADFWSUCCESS=Loading firmware Finished.
IDS_ERRBYLOADCFGFAIL=This operation didn't do,because of failing to load config information!
IDS_ERRBYLOADFWFAIL=This operation didn't do,because of failing to load firmware!
IDS_ERRBYOTHERRUNNING=This operation didn't do,because of other operation running!
IDS_ERRBYNOFOUNDDEVICE=This operation didn't do,because of no device!
IDS_ERRBYCREATESTEPFAIL=This operation didn't do,because of failing to create step!
IDS_ERRBYSETOBJECTFAIL=<Layer %s> This operation didn't do,because of failing to create object!
IDS_ERRBYNOTSUPPORTACTION=<Layer %s> This operation didn't do,because of not supporting!
IDS_ERRBYPRODUCTMODEL=This operation didn't do,because of failing to check product model!
IDS_SAVELOGSUCCESS=Save Log Success
IDS_SAVELOGFAIL=Save Log Fail!
IDS_SWITCHFAIL=<Layer %s> Switch Fail
IDS_CREATEUIDFAIL=The program can not create device's uid!


IDS_UPGRADEHEAD=**********Upgrade Action**********
IDS_RESTOREHEAD=**********Restore Action**********
IDS_SWITCHHEAD=**********Switch Action**********

IDS_UPGRADESTARTHEAD=**********Upgrade Start Total<%d>**********
IDS_RESTORESTARTHEAD=**********Restore Start Total<%d>**********
IDS_SWITCHSTARTHEAD=**********Switch Start Total<%d>**********

IDS_UPGRADEEND=**********Upgrade Done Success<%d> Fail<%d>**********
IDS_RESTOREEND=**********Restore Done Success<%d> Fail<%d>**********
IDS_SWITCHEND=**********Switch Done Success<%d> Fail<%d>**********


IDS_TESTDEVICEPROGRESSINFO=Test Device(%d%%)...
IDS_LOWERFORMATPROGRESSINFO=Lowerformat Device(%d%%)...
IDS_DOWNLOADIMAGEPROGRESSINFO=Download Firmware(%d%%)...
IDS_CHECKIMAGEPROGRESSINFO=Check Firmware(%d%%)...
IDS_TAGBADBLOCKPROGRESSINFO=Tag Bad Block(%d%%)...
IDS_TESTBLOCKPROGRESSINFO=Test Block(%d%%)...
IDS_ERASEFLASHPROGRESSINFO=Erase Flash(%d%%)...
IDS_ERASESYSTEMPROGRESSINFO=Erase System(%d%%)...

IDS_DOWNLOADBOOT_START=<Layer %s> Download Boot Start
IDS_DOWNLOADBOOT_FAIL=<Layer %s> Download Boot Fail
IDS_DOWNLOADBOOT_PASS=<Layer %s> Download Boot Success
IDS_DOWNLOADIDBLOCK_START=<Layer %s> Download IDB Start
IDS_DOWNLOADIDBLOCK_FAIL=<Layer %s> Download IDB Fail
IDS_DOWNLOADIDBLOCK_PASS=<Layer %s> Download IDB Success
IDS_DOWNLOADIMAGE_START=<Layer %s> Download Firmware Start
IDS_DOWNLOADIMAGE_FAIL=<Layer %s> Download Firmware Fail
IDS_DOWNLOADIMAGE_PASS=<Layer %s> Download Firmware Success
IDS_TESTDEVICE_START=<Layer %s> Test Device Start
IDS_TESTDEVICE_FAIL=<Layer %s> Test Device Fail
IDS_TESTDEVICE_PASS=<Layer %s> Test Device Success
IDS_LOWERFORMATDEVICE_START=<Layer %s> Lowerformat Device Start
IDS_LOWERFORMATDEVICE_FAIL=<Layer %s> Lowerformat Device Fail
IDS_LOWERFORMATDEVICE_PASS=<Layer %s> Lowerformat Device Success
IDS_RESETDEVICE_START=<Layer %s> Reset Device Start
IDS_RESETDEVICE_FAIL=<Layer %s> Reset Device Fail
IDS_RESETDEVICE_PASS=<Layer %s> Reset Device Success
IDS_FORMATDISK_START=<Layer %s> Format Disk Start
IDS_FORMATDISK_FAIL=<Layer %s> Format Disk Fail
IDS_FORMATDISK_PASS=<Layer %s> Format Disk Success
IDS_COPYDATA_START=<Layer %s> Copy Data Start
IDS_COPYDATA_FAIL=<Layer %s> Copy Data Fail
IDS_COPYDATA_PASS=<Layer %s> Copy Data Success
IDS_WAITMSC_START=<Layer %s> Wait For MSC Start
IDS_WAITMSC_FAIL=<Layer %s> Wait For MSC Fail
IDS_WAITMSC_PASS=<Layer %s> Wait For MSC Success
IDS_WAITLOADER_START=<Layer %s> Wait For Loader Start
IDS_WAITLOADER_FAIL=<Layer %s> Wait For Loader Fail
IDS_WAITLOADER_PASS=<Layer %s> Wait For Loader Success
IDS_WAITMASKROM_START=<Layer %s> Wait For Maskrom Start
IDS_WAITMASKROM_FAIL=<Layer %s> Wait For Maskrom Fail
IDS_WAITMASKROM_PASS=<Layer %s> Wait For Maskrom Success
IDS_ERASEIDB_START=<Layer %s> Erase IDB Start
IDS_ERASEIDB_FAIL=<Layer %s> Erase IDB Fail
IDS_ERASEIDB_PASS=<Layer %s> Erase IDB Success
IDS_SWITCHMSC_START=<Layer %s> Switch MSC Start
IDS_SWITCHMSC_FAIL=<Layer %s> Switch MSC Fail
IDS_SWITCHMSC_PASS=<Layer %s> Switch MSC Success
IDS_SHOWUSERDISK_START=<Layer %s> Show User Disk Start
IDS_SHOWUSERDISK_FAIL=<Layer %s> Show User Disk Fail
IDS_SHOWUSERDISK_PASS=<Layer %s> Show User Disk Success
IDS_SHOWDATADISK_START=<Layer %s> Show Data Disk Start
IDS_SHOWDATADISK_FAIL=<Layer %s> Show Data Disk Fail
IDS_SHOWDATADISK_PASS=<Layer %s> Show Data Disk Success
IDS_CHECKCHIP_START=<Layer %s> Check Chip Start
IDS_CHECKCHIP_FAIL=<Layer %s> Check Chip Fail
IDS_CHECKCHIP_PASS=<Layer %s> Check Chip Success
IDS_GETFLASHINFO_START=<Layer %s> Get FlashInfo Start
IDS_GETFLASHINFO_FAIL=<Layer %s> Get FlashInfo Fail
IDS_GETFLASHINFO_PASS=<Layer %s> Get FlashInfo Success
IDS_PREPAREIDB_START=<Layer %s> Prepare IDB Start
IDS_PREPAREIDB_FAIL=<Layer %s> Prepare IDB Fail
IDS_PREPAREIDB_PASS=<Layer %s> Prepare IDB Success
IDS_MUTEXRESETDEVICE_START=<Layer %s> Mutex Reset Device Start
IDS_MUTEXRESETDEVICE_FAIL=<Layer %s> Mutex Reset Device Fail
IDS_MUTEXRESETDEVICE_PASS=<Layer %s>--><Layer %s> Mutex Reset Device Success
IDS_GETOLDDISKSIZE_START=<Layer %s> Get Device Disk Size Start
IDS_GETOLDDISKSIZE_FAIL=<Layer %s> Get Device Disk Size Fail
IDS_GETOLDDISKSIZE_PASS=<Layer %s> Get Device Disk Size Success
IDS_READSN_START=<Layer %s> Read SN Start
IDS_READSN_FAIL=<Layer %s> Read SN Fail
IDS_READSN_PASS=<Layer %s> Read SN Success
IDS_WRITESN_START=<Layer %s> Write SN Start
IDS_WRITESN_FAIL=<Layer %s> Write SN Fail
IDS_WRITESN_PASS=<Layer %s> Write SN Success
IDS_ERASEALLBLOCKS_START=<Layer %s> Erase Flash Start
IDS_ERASEALLBLOCKS_FAIL=<Layer %s> Erase Flash Fail
IDS_ERASEALLBLOCKS_PASS=<Layer %s> Erase Flash Success
IDS_GETBLOCKSTATE_START=<Layer %s> Get Block State Start
IDS_GETBLOCKSTATE_FAIL=<Layer %s> Get Block State Fail
IDS_GETBLOCKSTATE_PASS=<Layer %s> Get Block State Success
IDS_FINDUSERDISK_START=<Layer %s> Find User Disk Start
IDS_FINDUSERDISK_FAIL=<Layer %s> Find User Disk Fail
IDS_FINDUSERDISK_PASS=<Layer %s> Find User Disk Pass
IDS_FINDDATADISK_START=<Layer %s> Find Data Disk Start
IDS_FINDDATADISK_FAIL=<Layer %s> Find Data Disk Fail
IDS_FINDDATADISK_PASS=<Layer %s> Find Data Disk Pass